tap "alexsjones/llmfit"
tap "arthur-ficial/tap"
tap "ashwch/tap"
tap "browsers-software/tap"
tap "buo/cask-upgrade"
tap "ggozad/formulas"
tap "quarkdown-labs/quarkdown"
tap "quickemu-project/quickemu", "https://github.com/quickemu-project/quickemu"
tap "shinokada/tera"
tap "tabbyml/tabby"
tap "thezoraiz/ascii-image-converter"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Core application library for C
brew "glib"
# General-purpose data compression with high compression ratio
brew "xz"
# Framework for layout and rendering of i18n text
brew "pango"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Open-source framework for augmenting humans using AI
brew "fabric-ai"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# List, fetch and generate .gitignore templates
brew "git-ignore"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Crawling and spidering framework
brew "katana"
# Simple terminal UI for git commands
brew "lazygit"
# Secure hashing function
brew "libb2"
# Generic machine emulator and virtualizer
brew "qemu"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# Find what models run on your hardware
brew "llmfit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Package manager for the Lua programming language
brew "luarocks"
# Security and system auditing tool to harden systems
brew "lynis"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Parallel gzip
brew "pigz"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Keccak, SHA-3, SHAKE, and RawSHAKE checksum utilities
brew "sha3sum"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# TOML toolkit written in Rust
brew "taplo"
# Tool Command Language
brew "tcl-tk@8"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# General purpose fuzzy finder TUI
brew "television"
# AI Chatbots in terminal without needing API keys
brew "tgpt"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Convert HTML to PDF
brew "weasyprint"
# Internet file retriever
brew "wget"
# Why is this running?
brew "witr"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# General-purpose lossless data-compression library
brew "zlib"
# On-device Apple FoundationModels CLI and OpenAI-compatible server
brew "arthur-ficial/tap/apfel"
# Native macOS debug GUI for apfel - Apple Intelligence debugging tool
brew "arthur-ficial/tap/apfel-gui"
# A modern Markdown-based typesetting system
brew "quarkdown-labs/quarkdown/quarkdown"
# Terminal-based internet radio player
brew "shinokada/tera/tera"
# Tabby: AI Coding Assistant
brew "tabbyml/tabby/tabby"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# Android SDK component
cask "android-platform-tools"
# AI Coding Agent IDE
cask "antigravity"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# User-friendly GUI app for Homebrew
cask "applite"
# Runbook editor for terminal workflows
cask "atuin-desktop"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Desktop password and login vault
cask "bitwarden"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# Web browser focusing on privacy
cask "brave-browser"
# Open the right browser at the right time
cask "browsers-software/tap/browsers"
# Open source IDE for exploring and testing APIs
cask "bruno"
# E-books management software
cask "calibre"
# Terminal-based AI coding assistant
cask "claude-code"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser focusing on privacy
cask "duckduckgo"
# Store securely encrypted backups in the cloud
cask "duplicati"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-3270-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-victor-mono-nerd-font"
# Folder comparison and synchronization software
cask "freefilesync"
# Mind mapping and knowledge management software
cask "freeplane"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Run LLMs locally
cask "gpt4all"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Offline AI chat tool
cask "jan"
# Menu bar manager
cask "jordanbaird-ice@beta"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Adaptive brightness for external displays
cask "lunar"
# Clipboard manager
cask "maccy"
# Markdown editor
cask "mark-text"
# Neovim Client
cask "neovide-app"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Android file transfer
cask "openmtp"
# LLM server built on MLX
cask "osaurus"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Data science IDE
cask "positron"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Menu bar customization tool
cask "swiftbar"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# AI code editor
cask "void"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Multiplayer code editor
cask "zed"
# Ad-blocker and privacy guard
cask "zen-privacy"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "1Blocker", id: 1365531024
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "Keynote", id: 409183694
mas "Momentum", id: 1564329434
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 409201541
mas "Refined GitHub", id: 1519867270
mas "SingleFile", id: 6444322545
mas "Speediness", id: 1596706466
mas "Vimari", id: 1480933944
vscode "aaron-bond.better-comments"
vscode "alexcvzz.vscode-sqlite"
vscode "aykutsarac.jsoncrack-vscode"
vscode "ban.spellright"
vscode "bierner.emojisense"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "gruntfuggly.todo-tree"
vscode "jgclark.vscode-todo-highlight"
vscode "johnnymorganz.stylua"
vscode "joshwong.vscode-jmespath"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mkhl.shfmt"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "naumovs.color-highlight"
vscode "nickdemayo.vscode-json-editor"
vscode "oderwat.indent-rainbow"
vscode "parallelsdesktop.parallels-desktop"
vscode "pkief.material-icon-theme"
vscode "quarkdown.quarkdown-vscode"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rpinski.shebang-snippets"
vscode "rust-lang.rust-analyzer"
vscode "shyykoserhiy.vscode-spotify"
vscode "sleistner.vscode-fileutils"
vscode "sumneko.lua"
vscode "tabbyml.pochi"
vscode "tabbyml.vscode-tabby"
vscode "tamasfe.even-better-toml"
vscode "tanhakabir.rest-book"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "ultram4rine.vscode-choosealicense"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wakatime.vscode-wakatime"
vscode "wattenberger.footsteps"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zokugun.cron-tasks"
vscode "zokugun.sync-settings"
go "github.com/projectdiscovery/katana/cmd/katana"
go "github.com/taigrr/spank"
cargo "somo"
