tap "alexsjones/llmfit", "https://github.com/AlexsJones/homebrew-llmfit", trusted: true
tap "arthur-ficial/tap", "https://github.com/Arthur-Ficial/homebrew-tap", trusted: true
tap "ashwch/tap", trusted: true
tap "browsers-software/tap", trusted: true
tap "buo/cask-upgrade", trusted: true
tap "ggozad/formulas", trusted: true
tap "quarkdown-labs/quarkdown", trusted: true
tap "quickemu-project/quickemu", "https://github.com/quickemu-project/quickemu", trusted: true
tap "shinokada/tera", trusted: true
tap "tabbyml/tabby", trusted: true
tap "thezoraiz/ascii-image-converter", "https://github.com/TheZoraiz/homebrew-ascii-image-converter", trusted: true
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Pyright fork with various improvements and built-in pylance features
brew "basedpyright"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Core application library for C
brew "glib"
# Framework for layout and rendering of i18n text
brew "pango"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Open-source framework for augmenting humans using AI
brew "fabric-ai"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# LSP implementation for the fish shell language
brew "fish-lsp"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Secure hashing function
brew "libb2"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# List, fetch and generate .gitignore templates
brew "git-ignore"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Go formatter that additionally inserts import statements
brew "goimports"
# Language server for the Go language
brew "gopls"
# Post-modern modal text editor
brew "helix"
# Instant coding answers via the command-line
brew "howdoi"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Crawling and spidering framework
brew "katana"
# Simple terminal UI for git commands
brew "lazygit"
# Generic machine emulator and virtualizer
brew "qemu"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# LLM inference in C/C++
brew "llama.cpp"
# Find what models run on your hardware
brew "llmfit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Security and system auditing tool to harden systems
brew "lynis"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Language Server Protocol for Markdown
brew "marksman"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Parallel gzip
brew "pigz"
# Paste PNG into files
brew "pngpaste"
# Tool for managing OCI containers and pods
brew "podman"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Blazing-fast modern Lua linter
brew "selene"
# Keccak, SHA-3, SHAKE, and RawSHAKE checksum utilities
brew "sha3sum"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# State of the art linter for the Go programming language
brew "staticcheck"
# Opinionated Lua code formatter
brew "stylua"
# TOML toolkit written in Rust
brew "taplo"
# Tool Command Language
brew "tcl-tk@8"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# General purpose fuzzy finder TUI
brew "television"
# AI Chatbots in terminal without needing API keys
brew "tgpt"
# Code-search similar to ack
brew "the_silver_searcher"
# Services for Typst
brew "tinymist"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Language servers for HTML, CSS, JavaScript, and JSON extracted from vscode
brew "vscode-langservers-extracted"
# LSP wrapper for typescript extension of vscode
brew "vtsls"
# Convert HTML to PDF
brew "weasyprint"
# Internet file retriever
brew "wget"
# Why is this running?
brew "witr"
# Language Server for Yaml Files
brew "yaml-language-server"
# Linter for YAML files
brew "yamllint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# On-device Apple FoundationModels CLI and OpenAI-compatible server
brew "arthur-ficial/tap/apfel"
# Native macOS debug GUI for apfel - Apple Intelligence debugging tool
brew "arthur-ficial/tap/apfel-gui"
# A modern Markdown-based typesetting system
brew "quarkdown-labs/quarkdown/quarkdown"
# Terminal-based internet radio player
brew "shinokada/tera/tera"
# Tabby: AI Coding Assistant
brew "tabbyml/tabby/tabby", link: false
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# Android SDK component
cask "android-platform-tools"
# Agent orchestration platform
cask "antigravity"
# Super-fast on-device AI chat for macOS — powered by apfel
cask "arthur-ficial/tap/apfel-chat"
# AI-powered clipboard actions from the macOS menu bar
cask "arthur-ficial/tap/apfel-clip"
# Instant AI overlay for macOS — press a key, ask anything
cask "arthur-ficial/tap/apfel-quick"
# A formula notepad for thinking — on-device AI as a first-class function
cask "arthur-ficial/tap/apfelpad"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# User-friendly GUI app for Homebrew
cask "applite"
# Runbook editor for terminal workflows
cask "atuin-desktop"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Open the right browser at the right time
cask "browsers-software/tap/browsers"
# Open source IDE for exploring and testing APIs
cask "bruno"
# E-books management software
cask "calibre"
# Terminal-based AI coding assistant
cask "claude-code"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser focusing on privacy
cask "duckduckgo"
# Store securely encrypted backups in the cloud
cask "duplicati"
# Collaborative team software
cask "figma"
cask "font-3270-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-victor-mono-nerd-font"
# Folder comparison and synchronization software
cask "freefilesync"
# Mind mapping and knowledge management software
cask "freeplane"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Run LLMs locally
cask "gpt4all"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Offline AI chat tool
cask "jan"
# Menu bar manager
cask "jordanbaird-ice@beta"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# GPU-based terminal emulator
cask "kitty"
# Menu bar app for running local LLMs
cask "llama-app"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Clipboard manager
cask "maccy"
# Neovim Client
cask "neovide-app"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Android file transfer
cask "openmtp"
# LLM server built on MLX
cask "osaurus"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Data science IDE
cask "positron"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Menu bar customization tool
cask "swiftbar"
# Virtual machines UI using QEMU
cask "utm"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# AI code editor
cask "void"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Multiplayer code editor
cask "zed"
# Ad-blocker and privacy guard
cask "zen-privacy"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "1Blocker", id: 1365531024
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "Keynote", id: 409183694
mas "Momentum", id: 1564329434
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 409201541
mas "Refined GitHub", id: 1519867270
mas "SingleFile", id: 6444322545
mas "Speediness", id: 1596706466
mas "Vimari", id: 1480933944
vscode "aaron-bond.better-comments"
vscode "alexcvzz.vscode-sqlite"
vscode "aykutsarac.jsoncrack-vscode"
vscode "ban.spellright"
vscode "bierner.emojisense"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "gruntfuggly.todo-tree"
vscode "jgclark.vscode-todo-highlight"
vscode "johnnymorganz.stylua"
vscode "joshwong.vscode-jmespath"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "naumovs.color-highlight"
vscode "nickdemayo.vscode-json-editor"
vscode "oderwat.indent-rainbow"
vscode "parallelsdesktop.parallels-desktop"
vscode "pkief.material-icon-theme"
vscode "quarkdown.quarkdown-vscode"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rpinski.shebang-snippets"
vscode "rust-lang.rust-analyzer"
vscode "shyykoserhiy.vscode-spotify"
vscode "sleistner.vscode-fileutils"
vscode "sumneko.lua"
vscode "tabbyml.pochi"
vscode "tabbyml.vscode-tabby"
vscode "tamasfe.even-better-toml"
vscode "tanhakabir.rest-book"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "ultram4rine.vscode-choosealicense"
vscode "usernamehw.errorlens"
vscode "vosca.vscode-v-analyzer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "waderyan.gitblame"
vscode "wakatime.vscode-wakatime"
vscode "wattenberger.footsteps"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xadillax.viml"
vscode "yzhang.markdown-all-in-one"
vscode "zokugun.cron-tasks"
vscode "zokugun.sync-settings"
go "cmd/go"
go "cmd/gofmt"
cargo "somo"
npm "standard"
